Revit 2027 API
FabricationConfigurationInfo.IsValid Method
 Checks if the fabrication configuration is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 True if the fabrication configuration is valid.
See Also
Reference
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace